### Pandas Basic

#### 1.  Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
num_series = pd.Series([4,8,15,16,23,42])

In [3]:
print(num_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### 2.  Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [4]:
sq_list = [x**2 for x in range(1,11)]

In [5]:
sq_series =pd.Series(sq_list)

In [6]:
print(sq_series)

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

#### 3. Create pandas Dataframe that contains the following data:

In [7]:
data_dict = {"Name" : ["Alice" , "Bob" , "Claire"],
            "Age" : [25,30,27],
            "Gender" : ["Female","Male","Female"]}

In [8]:
df = pd.DataFrame(data_dict)

In [9]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [10]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### 4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

**Ans: A Pandas DataFrame is a 2 dimensional,size mutable and potentially heterogeneous data structure, like a 2 dimensional array, or a table with rows and columns. Each column can have different data types like int, float, or string.**    
**While a series has only one dimensional data. Each column in a datadframe is a series.That is, When selecting a single column of a pandas DataFrame , the result is a pandas Series .**

In [11]:
#series example:
series1 = pd.Series([2,3,4,5,6])
print(series1)

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [12]:
#Dataframe example
df1 = pd.DataFrame({"Name": ["Dhyan","Dhyaneh"],
                   "Age": [24,25]})

df1

      Name  Age
0    Dhyan   24
1  Dhyaneh   25

In [13]:
type(df1)

pandas.core.frame.DataFrame

In [14]:
#every column in dataframe is a series

type(df1["Name"])

pandas.core.series.Series

#### 5.  What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

**Ans : Some of the common data manipulation functions are as follows:**  
1. **pandas.drop() : Drop one or more columns or rows**
2. **pandas.rename() : rename column names**
3. **pandas.drop_duplicates() : remove duplicates.**
4. **pandas.groupby() : group by a specific column/attribute and get aggregated values for it.**
5. **pandas.replace() : replace the values of a column with some other values**

In [15]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [18]:
#dropping column "SibSp uinf Drop()"
df.drop("SibSp",axis= 1 ,inplace=True)

In [19]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [20]:
#rename()
df_renamed = df.rename(columns={"PassengerId":"PID"})

In [21]:
df_renamed.columns

Index(['PID', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [22]:
#Dropping duplicates 
df.drop_duplicates(inplace=True)

In [23]:
#Group by function

df.groupby("Sex").agg({"Fare":"mean"})

             Fare
Sex
female  44.479818
male    25.523893

In [24]:
df.groupby(["Pclass","Sex"]).agg({"Fare":"mean"})

                     Fare
Pclass Sex
1      female  106.125798
       male     67.226127
2      female   21.970121
       male     19.741782
3      female   16.118810
       male     12.661633

In [25]:
#Replace() 

df["Sex"].replace(["male","female"],["M","F"],inplace=True)

In [26]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",M,22.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",F,38.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",F,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",F,35.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",M,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",M,27.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",F,19.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",F,NaN,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",M,26.0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",M,32.0,0,370376,7.7500,NaN,Q

#### 6. Which of the following is mutable in nature Series, DataFrame, Panel?

**Ans :All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.**

#### 7.  Create a DataFrame using multiple Series. Explain with an example.

In [27]:
names = pd.Series(["Dhyan","Dhyanesh"])
ages = pd.Series([23,25])

In [28]:
my_df = pd.DataFrame({"Name": names,"Age": ages})

In [29]:
my_df

       Name  Age
0     Dhyan   23
1  Dhyanesh   25